<template>
  <div :class="$style.body">
    <div :class="$style.title">
      Паттерны: познание и поведение, связанныес разработкой интерфейсов
    </div>
    <div :class="$style.text">
      <p>
        Следующие паттерны являются одними из наиболее распространенных способов
        мышления и поведения людей в отношении программных интерфейсов. Даже при
        том, что личность уникальна, люди в целом ведут себя предсказуемо.
        Дизайнеры уже многие годы заходят на сайты и наблюдают за
        пользователями, когнитивисты и другие исследователи провели бесчисленное
        количество часов, наблюдая за тем, как люди совершают поступки и как они
        думают о своих действиях.
      </p>
      <p>
        Поэтому, когда вы наблюдаете за людьми, использующими вашу программу или
        делающими что-то, для чего вы хотите создать новый программный
        инструмент, вы ожидаете от них определенных моделей поведения. Следующие
        паттерны часто наблюдаются в поведении пользователей. Велика
        вероятность, что вы их тоже увидите, особенно если будете искать.
      </p>
      <p :class="$style.subtitle">ПРИМЕЧАНИЕ</p>
      <p :class="$style.forSubtitle">
        Для всех любителей паттернов: эти паттерны не похожи на те, что будут
        обсуждаться в следующих главах нашей книги. Они описывают человеческое
        поведение, а не элементы дизайна интерфейса, и они не являются
        предписывающими, как те, что рассматриваются в других главах. Вместо
        структурного представления, как это сделано для других паттернов, здесь
        дано их краткое описание.
      </p>
      <p>
        Повторюсь, интерфейс, который поддерживает эти паттерны, поможет
        пользователям достичь своих целей гораздо эффективнее, чем интерфейсы,
        которые их не поддерживают. И паттерны имеют значение не только для
        разработки интерфейса. Иногда весь пакет: интерфейс, базовую
        архитектуру, выбор функций, документацию, — все необходимо рассматривать
        в свете этих моделей поведения. Но как дизайнер интерфейса или
        проектировщик способов взаимодействия, вы должны думать об этом не
        меньше, чем любой другой член вашей команды. Возможно, именно вам
        удобнее всего представлять интересы пользователей.
      </p>
      <ul>
        <li>Safe Exploration (Безопасное исследование).</li>
        <li>Instant Gratification (Мгновенное вознаграждение).</li>
        <li>Satisficing (Разумная достаточность).</li>
        <li>Changes in Midstream (Изменения на полпути).</li>
      </ul>
    </div>
  </div>
</template>
<script setup></script>
<style lang="scss" module>
.body {
  @include container;
  width: 100%;
  min-height: 100vh;
  // height: 100vh;
  margin-top: 1rem;
  .title {
    @include H2;
    margin-bottom: 1.5rem;
  }
  .text {
    @include LargText;
    text-align: justify;
    p {
      margin-bottom: 1rem;
    }
    .subtitle {
      @include Subtitle-bold;
    }
    .forSubtitle {
      margin-left: 2rem;
    }
    ul {
      list-style-type: disc;
      margin-left: 1rem;
    }
  }
}
</style>
